{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4-tf",
  "convertedBy": "TensorFlow.js Converter v1.3.1.1",
  "modelTopology": {
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
            "layers": [
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv_1_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                64,
                64,
                3
              ],
              "dtype": "float32",
              "filters": 7,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "relu_1_1",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv_1_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 7,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "relu_1_2",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pool_1",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv_2_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 7,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "relu_2_1",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv_2_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 7,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "relu_2_2",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pool_2",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "output",
              "trainable": true,
              "dtype": "float32",
              "units": 7,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "./fer/group1-shard1of6.bin",
        "./fer/group1-shard2of6.bin",
        "./fer/group1-shard3of6.bin",
        "./fer/group1-shard4of6.bin",
        "./fer/group1-shard5of6.bin",
        "./fer/group1-shard6of6.bin"
      ],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [
            3,
            3,
            1,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/kernel",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_3/kernel",
          "shape": [
            3,
            3,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_3/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_4/kernel",
          "shape": [
            3,
            3,
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_4/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_5/kernel",
          "shape": [
            3,
            3,
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_5/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/gamma",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/beta",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/moving_mean",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/moving_variance",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_6/kernel",
          "shape": [
            3,
            3,
            256,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_6/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/gamma",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/beta",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/moving_mean",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/moving_variance",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_7/kernel",
          "shape": [
            3,
            3,
            256,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_7/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/gamma",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/beta",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/moving_mean",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/moving_variance",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_8/kernel",
          "shape": [
            3,
            3,
            512,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_8/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/gamma",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/beta",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/moving_mean",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/moving_variance",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            2048,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            512,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel",
          "shape": [
            256,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_4/kernel",
          "shape": [
            128,
            7
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_4/bias",
          "shape": [
            7
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}